Revit 2027 API
BuiltInFailures.InfillFailures.InfillDifferentPhase Property
 Wall and instance have different phasing settings. Automatic creation of the infilling wall fails.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InfillDifferentPhase { get; }
Public Shared ReadOnly Property InfillDifferentPhase As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InfillDifferentPhase {
	FailureDefinitionId^ get ();
}
static member InfillDifferentPhase : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.InfillFailures Class
Autodesk.Revit.DB Namespace